## Reading CSV and TXT files

In [12]:
import pandas as pd

In [13]:
# Importing a CSV into Python without a header
url='imports-85.data'
df= pd.read_csv(url, header=None)
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,16,17,18,19,20,21,22,23,24,25
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450

In [14]:
# Replacing default headers
headers=['symboling', 'normalized-losses', 'make', 'fuel type', 'aspiration', 'num-of-doors', 'body style', 'drive-wheels', 'engine-location', 'wheel-base', 'length', 'width', 'height', 'curb-weight', 'engine-type', 'num-of-cylinders', 'engine-size', 'fuel-system', 'bore', 'stroke', 'compression-ratio', 'horsepower', 'peak-rmp', 'city-mpg', 'highway-mpg', 'price']
df.columns=headers
df.head(5)

,symboling,normalized-losses,make,fuel type,aspiration,num-of-doors,body style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rmp,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450

In [15]:
# Exporting a Pandas dataframe to csv
path="C:/Users/FAITHFULNESS/Desktop/Python Exercises/automobile.csv"
df.to_csv(path)

In [16]:
# Manipulating a dataframe
df['symboling']=df['symboling']+1
print(df['symboling'])

0      4
1      4
2      2
3      3
4      3
      ..
200    0
201    0
202    0
203    0
204    0
Name: symboling, Length: 205, dtype: int64

## Reading Data

In [17]:
import pandas as pd

In [18]:
# Invoking the open() function to open the file you want to work on.
# The with statement closes the file once it leaves the with block

filepath ='btc-market-price.csv'
with open(filepath, 'r') as reader:
        print(reader)

<_io.TextIOWrapper name='btc-market-price.csv' mode='r' encoding='cp1252'>

In [19]:
# To read the contents of the file
filepath ='btc-market-price.csv'
with open(filepath, 'r') as reader:
    for index, line in enumerate(reader.readlines()):
        if(index< 10): # To read just the first 10 lines
            print(index, line)

0 2/4/2017 0:00,1099.169125

1 3/4/2017 0:00,1141.813

2 4/4/2017 0:00,1141.600363

3 5/4/2017 0:00,1133.079314

4 6/4/2017 0:00,1196.307938

5 7/4/2017 0:00,1190.45425

6 8/4/2017 0:00,1181.149838

7 9/4/2017 0:00,1208.8005

8 10/4/2017 0:00,1207.744875

9 11/4/2017 0:00,1226.617038

In [20]:
df =pd.read_csv('btc-market-price.csv', header=None)
df.head()

               0            1
0  2/4/2017 0:00  1099.169125
1  3/4/2017 0:00  1141.813000
2  4/4/2017 0:00  1141.600363
3  5/4/2017 0:00  1133.079314
4  6/4/2017 0:00  1196.307938

In [21]:
# Define missing values with na_values parameter
df =pd.read_csv('btc-market-price.csv', header=None,
na_values=['','?', '-'])
df.head()

               0            1
0  2/4/2017 0:00  1099.169125
1  3/4/2017 0:00  1141.813000
2  4/4/2017 0:00  1141.600363
3  5/4/2017 0:00  1133.079314
4  6/4/2017 0:00  1196.307938

In [22]:
# Adding columns names using the names parameter.
df =pd.read_csv('btc-market-price.csv', header=None,
na_values=['','?', '-'],
names=['Timestamp', 'Price'])
df.head()

       Timestamp        Price
0  2/4/2017 0:00  1099.169125
1  3/4/2017 0:00  1141.813000
2  4/4/2017 0:00  1141.600363
3  5/4/2017 0:00  1133.079314
4  6/4/2017 0:00  1196.307938

In [23]:
# We can use dtype parameter to force pandas to use certain dtype.
df =pd.read_csv('btc-market-price.csv', header=None,
                na_values=['','?', '-'],
                names=['Timestamp', 'Price'],
                dtype={'Price':'float'})
df.head()

       Timestamp        Price
0  2/4/2017 0:00  1099.169125
1  3/4/2017 0:00  1141.813000
2  4/4/2017 0:00  1141.600363
3  5/4/2017 0:00  1133.079314
4  6/4/2017 0:00  1196.307938

In [24]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [25]:
# To change Timestamp column to Datetime objects using to_datetime method
pd.to_datetime(df['Timestamp']).head()

0   2017-02-04
1   2017-03-04
2   2017-04-04
3   2017-05-04
4   2017-06-04
Name: Timestamp, dtype: datetime64[ns]

In [26]:
df['Timestamp']=pd.to_datetime(df['Timestamp'])
df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04  1141.600363
3 2017-05-04  1133.079314
4 2017-06-04  1196.307938

In [27]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

### Adding index to our data using index_col parameter

By default, pandas will automatically assign a numeric autoincremental index or row label starting with zero. You may want to leave the default index as such if your data doesn’t have a column with unique values that can serve as a better index. In case there is a column that you feel would serve as a better index, you can override the default behavior by setting index_col property to a column. It takes a numeric value representing the index or a string of the column name for setting a single column as index or a list of numeric values or strings for creating a multi-index.

In our data, we are choosing the first column, Timestamp, as index (index=0) by passing zero to the index_col argument.

In [31]:
df= pd.read_csv('btc-market-price.csv',
               header=None,
                na_values=['','?','-'],
                names=['Timestamp', 'Price'],
                dtype={'Price':'float'},
                parse_dates=[0],
                index_col=[0])
df.head()

                  Price
Timestamp
2017-02-04  1099.169125
2017-03-04  1141.813000
2017-04-04  1141.600363
2017-05-04  1133.079314
2017-06-04  1196.307938

In [32]:
df.dtypes

Price    float64
dtype: object

### Parsing

In [33]:
exam_df= pd.read_csv('exam_review.csv')
exam_df

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

### Custom data delimiters using sep parameter

We can define which delimiter to use by using the sep parameter. If we don't use the sep parameter, pandas will automatically detect the separator.

In most CSV files, the separator will be comma (,) and will be automatically detected. But we can find files with other separators like semicolon (;), tabs (\t, specially on TSV files), whitespaces or any other special character.

In this case the separator is a > character.

In [34]:
exam_df=pd.read_csv('exam_review.csv', sep='>')
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

### Custom data encoding

Files are stored using different "encodings", such as ASCII, UTF-8, latin1, etc.

While reading data custom encoding can be defined with the encoding parameter.

- encoding='UTF-8': will be used if data is UTF-8 encoded.
- encoding='iso-8859-1': will be used if data is ISO/IEC 8859-1 ("extended ASCII") encoded.

In our case we don't need a custom enconding as data is properly loaded.

### Custom numeric decimal and thousands character

The decimal and thousands characters could change between datasets. If we have a column containing a comma (,) to indicate the decimal or thousands place, then this column would be considered a string and not numeric.

In [35]:
exams_df= pd.read_csv('exam_review.csv', sep='>')
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [36]:
exam_df[['math_score', 'french_score']].dtypes

math_score      object
french_score    object
dtype: object

To solve this, ensuring such columns are interpreted as integer values, we'll need to use the decimal and/or thousands parameters to indicate correct decimal and/or thousands indicators.

In [37]:
exam_df= pd.read_csv('exam_review.csv', 
                     sep='>',
                     decimal=',')
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [38]:
exam_df[['math_score', 'french_score']].dtypes

math_score      float64
french_score    float64
dtype: object

In [39]:
# Now, the thousands parameter
pd.read_csv('exam_review.csv', 
                     sep='>',
                     thousands=',')

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

### Excluding specific rows

We can use the skiprows to:

- Exclude reading specified number of rows from the beginning of a file, by passing an integer argument. This removes the header too.
- Skip reading specific row indices from a file, by passing a list containing row indices to skip

In [40]:
pd.read_csv('exam_review.csv', 
                     sep='>',
                     skiprows=2)

   Melvin   Scott  24      77  83
0  Amirah   Haley  22      92  67
1  Gerard   Mills  19  78,000  72
2     Amy  Grimes  23      91  81

In [41]:
exam_df= pd.read_csv('exam_review.csv', 
                     sep='>',
                     decimal=',',
                     skiprows=[1,3])
exam_df

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

### Get rid of blank lines

The skip_blank_lines parameter is set to True so blank lines are skipped while we read files.

If we set this parameter to False, then every blank line will be loaded with NaN values into the DataFrame

In [42]:
pd.read_csv('exam_review.csv',
           sep='>',
           skip_blank_lines=False)

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

### Loading specific columns

We can use the usecols parameter when we want to load just specific columns and not all of them.

Performance wise, it is better because instead of loading an entire dataframe into memory and then deleting the not required columns, we can select the columns that we’ll need, while loading the dataset itself.

As a parameter to usecols, you can pass either a list of strings corresponding to the column names or a list of integers corresponding to column index.

In [43]:
pd.read_csv('exam_review.csv',
           usecols=['first_name', 'last_name', 'age'],
           sep='>')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [44]:
# Using column position
pd.read_csv('exam_review.csv',
           usecols=[0,1,2],
           sep='>')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

### Using a Series instead of DataFrame

If the parsed data only contains one column then we can return a Series by setting the squeeze parameter to True.

In [45]:
exam_test_1= pd.read_csv('exam_review.csv',
           usecols=['last_name'],
           sep='>')
type(exam_test_1)

pandas.core.frame.DataFrame

In [46]:
exam_test_2= pd.read_csv('exam_review.csv',
           usecols=['last_name'],
           sep='>',
           squeeze=True)
type(exam_test_2)

C:\Users\FAITHFULNESS\AppData\Local\Temp\ipykernel_24624\3597813120.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  exam_test_2= pd.read_csv('exam_review.csv',

pandas.core.series.Series

### Save to CSV file

We can save our DataFrame as a CSV file

In [47]:
exam_df

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

In [48]:
# Generate a CSV string from the DataFrame:

exam_df.to_csv()

',first_name,last_name,age,math_score,french_score\r\n0,Melvin,Scott,24,77.0,83\r\n1,Gerard,Mills,19,78.0,72\r\n2,Amy,Grimes,23,91.0,81\r\n'

Or specify a file path where we want our generated CSV code to be saved:

In [49]:
exam_df.to_csv('out.csv')

In [50]:
pd.read_csv('out.csv')

   Unnamed: 0 first_name last_name  age  math_score  french_score
0           0     Melvin     Scott   24        77.0            83
1           1     Gerard     Mills   19        78.0            72
2           2        Amy    Grimes   23        91.0            81

In [51]:
exam_df.to_csv('out.csv',
              index=None)
pd.read_csv('out.csv')

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81